src/Documents/ИТСервисы_РегистрацияДокументации/ИТСервисы_РегистрацияДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_РегистрацияДокументации</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументацияСервиса</name>
    <attributes>
      <name>ТипДокументации</name>
      <type>
        <types>CatalogRef.ИТСервисы_ТипыДокументации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ИТСервисы_СтатусыДокументации</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторДокумента</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ИТСервисы_ФайлыДокументации/ИТСервисы_ФайлыДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ФайлыДокументации</name>
  <attributes>
    <name>ДокументВладелец</name>
    <type>
      <types>DocumentRef.ИТСервисы_РегистрацияДокументации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ИТСервисы_РегистрацияДокументации/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Асинх Процедура ЗагрузитьФайл(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Не Записать() Тогда Возврат; КонецЕсли;
	КонецЕсли;
	
	ТекСтрока = Элементы.ДокументацияСервиса.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите документ PDF";
	
	Диалог.Фильтр = "Утвержденные документы (PDF, Word, Excel)|*.pdf;*.doc;*.docx;*.xls;*.xlsx";

	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	ПолноеИмяФайла = ВыбранныеФайлы[0];
	ФайлДанных = Новый Файл(ПолноеИмяФайла);
	
	Описание = Ждать ПоместитьФайлНаСерверАсинх(,,, ПолноеИмяФайла);
	
	СохранитьФайлВБазуНаСервере(Описание.Адрес, ФайлДанных.ИмяБезРасширения, ФайлДанных.Расширение, ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура СохранитьФайлВБазуНаСервере(АдресВременногоХранилища, ИмяБезРасширения, Расширение, ИДСтрокиНаКлиенте)
	
	ТекСтрока = Объект.ДокументацияСервиса.НайтиПоИдентификатору(ИДСтрокиНаКлиенте);
	Если ПустаяСтрока(ТекСтрока.ИдентификаторСтроки) Тогда
		ТекСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	НовыйФайл = Справочники.ИТСервисы_ФайлыДокументации.СоздатьЭлемент();
	НовыйФайл.Наименование = ИмяБезРасширения + Расширение;
	НовыйФайл.ДокументВладелец = Объект.Ссылка;
	НовыйФайл.ИдентификаторСтроки = ТекСтрока.ИдентификаторСтроки;
	НовыйФайл.Расширение = Расширение;

	НовыйФайл.ФайлХранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилища)); 
	НовыйФайл.Записать();
	
	ТекСтрока.ИмяФайла = ИмяБезРасширения + Расширение;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыгрузитьФайл(Команда)
	
	ТекСтрока = Элементы.ДокументацияСервиса.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	ДанныеФайла = ПолучитьДанныеФайлаНаСервере(ТекСтрока.ИдентификаторСтроки);
	Если ДанныеФайла = Неопределено Тогда 
		ПоказатьПредупреждение(, "Файл не найден!"); 
		Возврат; 
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.ПолноеИмяФайла = ТекСтрока.ИмяФайла;
	
	ВыбранныеФайлы = Ждать Диалог.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;

	Ждать ПолучитьФайлССервераАсинх(ДанныеФайла.Адрес, ВыбранныеФайлы[0]);
	
	ПоказатьОповещениеПользователя("Успешно", , "Файл выгружен!");
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеФайлаНаСервере(ИДСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ФайлХранилище КАК Хранилище,
		|	Файлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.ИТСервисы_ФайлыДокументации КАК Файлы
		|ГДЕ
		|	Файлы.ИдентификаторСтроки = &ИДСтроки";
	
	Запрос.УстановитьПараметр("ИДСтроки", ИДСтроки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Хранилище = Выборка.Хранилище.Получить();
		Если Хранилище <> Неопределено Тогда
			Адрес = ПоместитьВоВременноеХранилище(Хранилище, УникальныйИдентификатор);
			Возврат Новый Структура("Адрес, Расширение", Адрес, Выборка.Расширение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
